print("{:.2f} asdasda".format(3))

# 对齐效果  【填充字符】 【对齐方式】 【正负号样式】 【宽度】 【千位符】 【.精度】 【数据类型】
print("{:9}".format(123))  # 1.默认右对齐
print("{}".format(123))    # 2.默认长度是0
print("{:0}".format(123))  # 3.使用空格进行填充

print("{:<9}".format(321))  # 左对齐
print("{:^9}".format(123))  # 中间对齐

print("{:*<9}".format(321))  # 更改填充的字符
print("{:1<9}".format(321))
# 类型和精度效果
print("{:*<+9}".format(456))  # 如果是正数就显示+号
print("{:*<-9}".format(-456))  # 如果是负数就显示-号

print("{:*<9,}".format(123456789))  # 千位符

print("{:.2}".format(3.141592653))  # 按照数字去处理，两位
print("{:.2}".format("3.141592653"))  # 按照字符串去输出两位

print("{:.2f}".format(3.141592653))   # 按小数点后两位

print("{:2%}".format(3.14159))  # 按百分比来显示
print("{:2c}".format(65))  # 转换成ASCII对应的字符
print("{:b}".format(100))  # 转换成二进制
print("{:o}".format(10))   # 转换成八进制
# d:转换成十进制
# x:转换成十六进制
# X:转换成十六进制，其中字母是大写
# e:数字的指数表示形式，默认精度为6    整数和浮点是共有
# E:数字的指数表示形式，其中字母大写    整数和浮点是共有
# f:浮点数，默认精度为6              整数和浮点是共有
# %:百分比                         整数和浮点是共有

# python3.9中实现格式化
# f-string
a = 1
b = 2
print("{a}, {b}".format(a=a, b=b))
print(f"{a}, {b}")
print(f"{a:.2f} {b}")
print(f"{a=}, {a}")



